src/DataProcessors/РабочееМестоКассира/РабочееМестоКассира.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоКассира</name>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>DefinedType.ВидОперацииРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговыйОбъект</name>
    <type>
      <types>DefinedType.ТорговыйОбъектРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>DefinedType.КассаККМРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.Число15_2РМК</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>DefinedType.НалогообложениеНДСРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>DefinedType.КассирРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ДисконтнаяКарта</name>
    <type>
      <types>DefinedType.ДисконтнаяКартаРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательБД</name>
    <type>
      <types>DefinedType.ПользовательРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DefinedType.ЗаказПокупателяРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРасчета</name>
    <type>
      <types>DefinedType.ДокументРасчетаРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияСДенежнымиСредствами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплачивается</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Число15_3РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.Число15_3РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимостьВводаКодаМаркировки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.НоменклатураРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>DefinedType.ОрганизацияРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <type>
        <types>DefinedType.Число5_2РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>DefinedType.Число5_2РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>СистемаНалогообложения</name>
      <type>
        <types>DefinedType.ТипыСистемНалогообложенияККТРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>DefinedType.СтавкаНДСРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.НеотрицательноеЧисло15_2_РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <type>
        <types>DefinedType.Число15_2РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезСкидки</name>
      <type>
        <types>DefinedType.НеотрицательноеЧисло15_2_РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.НеотрицательноеЧисло15_2_РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидкиНаценки</name>
      <type>
        <types>DefinedType.НеотрицательноеЧисло15_2_РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидкиОплатыБонусом</name>
      <type>
        <types>DefinedType.Число15_2РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>ТорговыйОбъект</name>
      <type>
        <types>DefinedType.ТорговыйОбъектРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.УпаковкаРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Число15_2РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимостьВводаСерии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Продавец</name>
      <type>
        <types>DefinedType.ПродавецРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПартияРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧастичноеВыбытиеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>8</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧастичноеВыбытиеВариантУчета</name>
      <type>
        <types>DefinedType.ВариантУчетаЧастичногоВыбытияРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧастичноеВыбытиеНоменклатура</name>
      <type>
        <types>DefinedType.НоменклатураРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧастичноеВыбытиеХарактеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>DefinedType.ЯчейкаРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Подарок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыводитьПодарокВЧек</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВладелецПодарка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплата</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>DefinedType.ВидОплатыРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Число15_2РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭквайринговыйТерминал</name>
      <type>
        <types>DefinedType.ЭквайринговыйТерминалРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПлатежнойКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>24</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЧекаЭТ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СсылочныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентКомиссии</name>
      <type>
        <types>DefinedType.Число5_2РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКомиссии</name>
      <type>
        <types>DefinedType.Число15_2РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодарочныйСертификат</name>
      <type>
        <types>DefinedType.НоменклатураРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСертификата</name>
      <type>
        <types>DefinedType.НомерСертификатаРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПлатежнойСистемы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/Enums/ТипыПодключаемогоОборудования/ТипыПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПодключаемогоОборудования</name>
  <enumValues>
    <name>СканерШтрихкода</name>
    <comment>Scanner</comment>
  </enumValues>
  <enumValues>
    <name>СчитывательМагнитныхКарт</name>
    <comment>MSR</comment>
  </enumValues>
  <enumValues>
    <name>ККТ</name>
    <comment>KKT</comment>
  </enumValues>
  <enumValues>
    <name>ФискальныйРегистратор</name>
    <comment>FiscalPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЧеков</name>
    <comment>ReceiptPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ДисплейПокупателя</name>
    <comment>LineDisplay</comment>
  </enumValues>
  <enumValues>
    <name>ТерминалСбораДанных</name>
    <comment>DataCollectionTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭквайринговыйТерминал</name>
    <comment>AcquiringTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеВесы</name>
    <comment>Scale</comment>
  </enumValues>
  <enumValues>
    <name>ВесыСПечатьюЭтикеток</name>
    <comment>ScaleOffline</comment>
  </enumValues>
  <enumValues>
    <name>УдалитьККМОфлайн</name>
    <comment>ECROffline</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЭтикеток</name>
    <comment>LabelPrinter</comment>
  </enumValues>
  <enumValues>
    <name>СчитывательRFID</name>
    <comment>RFID</comment>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/РабочееМестоКассира/Forms/ФормаВыбораЧека/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	ЭтоЧекКоррекции = Параметры.Свойство("ЧекКоррекции");
	ЭтоВозвратПродажи = Параметры.Свойство("ВозвратПродажи");
	
	ОбщегоНазначенияРМКПереопределяемый.СформироватьЗапросТаблицаЧековПоУмолчанию(ЭтотОбъект);
	Если Параметры.Свойство("ВозвратПродажи") Тогда
		
		ЗаполнитьТаблицуЧековККМ();
		
	ИначеЕсли Параметры.Свойство("ВозвратСкупки") Тогда
		
		ЗаполнитьТаблицуЧековККМНаВозвратСкупки();
		
	ИначеЕсли Параметры.Свойство("ВыборДокументаРассрочки") Тогда
		
		Элементы.ВозвратБезЧека.Видимость = Ложь;
		ЗаполнитьТаблицуЧековККМОплаченныхВРассрочку();
		
	ИначеЕсли Параметры.Свойство("ВыборОтложенногоЧека") Тогда
		
		Элементы.ГруппаПодсказкаПоискЧекаПоКоду.Видимость = Ложь;
		Элементы.ВозвратБезЧека.Видимость = Ложь;
		ЗаполнитьТаблицуОтложенныхЧековККМ();
		
	ИначеЕсли Параметры.Свойство("РежимПечатиЧека") Тогда
		
		РежимПечатиЧека = Параметры.РежимПечатиЧека;
		Элементы.ВозвратБезЧека.Видимость = Ложь;
		ЗаполнитьТаблицуЧековККМДляПовторнойПечати();
		
	ИначеЕсли ЭтоЧекКоррекции Тогда
		
		Элементы.ВозвратБезЧека.Видимость = Ложь;
		ЗаполнитьТаблицуЧековККМ();
		
	КонецЕсли;
	
	Если Параметры.Свойство("МассивКассККМ") Тогда
		
		МассивКассККМ = Параметры.МассивКассККМ;
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаЧековККМ,
			"МассивКассККМ",
			МассивКассККМ);
			
	КонецЕсли;
	
	Если Параметры.Свойство("МассивОрганизаций") Тогда
		
		МассивОрганизаций = Параметры.МассивОрганизаций;
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаЧековККМ,
			"МассивОрганизаций",
			МассивОрганизаций);
			
	КонецЕсли;
	
	Если Параметры.Свойство("ТорговыйОбъект") Тогда
		
		ТорговыйОбъект = Параметры.ТорговыйОбъект;
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаЧековККМ,
			"ТорговыйОбъект",
			ТорговыйОбъект);
			
	КонецЕсли;
	
	Если Параметры.Свойство("ВыводитьКомментарийКЧеку") Тогда

		Элементы.ТаблицаЧековККМКомментарий.Видимость = Параметры.ВыводитьКомментарийКЧеку;

	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаЧековККМ,
		"ИсключатьЧекиККМСВозвратами",
		ЭтоЧекКоррекции);
		
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаЧековККМ,
		"ИсключатьЧекиККМПредоплатыЗачтеные",
		ЭтоВозвратПродажи);
	
	ПоддерживаемыеТипыПО = НСтр("ru = 'СканерШтрихкода'");
	ОбщегоНазначенияРМК.НастроитьПодключаемоеОборудование(ЭтотОбъект, "");
	ПродажиРМК.ЗаполнитьТаблицуОборудование(ЭтотОбъект, ПоддерживаемыеТипыПО);
	
	УстановитьУсловноеОформление();
	
	ИспользоватьПодключаемоеОборудование = ПолучитьФункциональнуюОпцию("ИспользоватьПодключаемоеОборудование");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ИспользоватьПодключаемоеОборудование Тогда
		
		Для Каждого СтрокаТЧ Из Оборудование Цикл
			
			ОповещениеОНачалеПодключения = Новый ОписаниеОповещения(
				"НачатьПодключениеОборудованиеПоИдентификаторуЗавершение",
				ЭтотОбъект, 
				СтрокаТЧ);
			
			МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоИдентификатору(
				ОповещениеОНачалеПодключения,
				УникальныйИдентификатор,
				СтрокаТЧ.Ссылка);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		
		Если ИмяСобытия = "ScanData" Тогда
			
			Если Параметр[1] = Неопределено Тогда
				Штрихкод = Параметр[0];
			Иначе
				Штрихкод = Параметр[1][1];
			КонецЕсли;
			
			ВыполнитьПоискЧекаККМ(Штрихкод);
			
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ОбщегоНазначенияРМККлиент.ИспользоватьВнешнееСобытие() И ВводДоступен() Тогда
		
		Если Событие = "Штрихкод" Или Событие = "ПолученШтрихкод" Или Событие = "ScanData" Тогда
			ВыполнитьПоискЧекаККМ(Данные);
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаЧеков

&НаКлиенте
Процедура ТаблицаЧековККМВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗафиксироватьВыбор();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ЗафиксироватьВыбор();
КонецПроцедуры

&НаКлиенте
Процедура ВозвратБезЧека(Команда)
	
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("ВозвратБезЧека");
	Закрыть(СтруктураСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуОтложенныхЧековККМ()
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьТаблицуОтложенныхЧековККМ(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЧековККМ()
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьТаблицуЧековККМНаВозврат(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЧековККМДляПовторнойПечати()
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьТаблицуЧековККМДляПовторнойПечати(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьВыбор()
	
	ТекущиеДанные = Элементы.ТаблицаЧековККМ.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Закрыть();
	Иначе
		
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("ЧекККМ", ТекущиеДанные.Ссылка);
		СтруктураСтроки.Вставить("СуммаРассрочки", ТекущиеДанные.СуммаДокумента);
		
		Если ЗначениеЗаполнено(РежимПечатиЧека) Тогда
			СтруктураСтроки.Вставить("РежимПечатиЧека", РежимПечатиЧека);
		КонецЕсли;
		
		Закрыть(СтруктураСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоискЧекаККМ(Штрихкод)
	
	РасшифровкаКода = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.РасшифроватьQRКодЧекаККТ(Штрихкод);
	
	УстановитьПривилегированныйРежим(Истина);
	
	НайденныеЧеки = Новый Массив;
	
	Если РасшифровкаКода.Расшифрован Тогда
		Запрос = Новый Запрос;
		ОбщегоНазначенияРМКПереопределяемый.СформироватьЗапросЧекПоФискальномуПризнаку(Запрос, ЭтотОбъект, РасшифровкаКода);
		Если Не ЗначениеЗаполнено(Запрос.Текст) Тогда
			ТекстОшибки = НСтр("ru = 'Не сформирован запрос для поиска чека по фискальному признаку.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		ВыборкаНайденныхЧеков = Запрос.Выполнить().Выбрать();
		Пока ВыборкаНайденныхЧеков.Следующий() Цикл
			НайденныеЧеки.Добавить(ВыборкаНайденныхЧеков.Ссылка);
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ФискальныеОперации.ДокументОснование КАК Ссылка
		|ИЗ
		|	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
		|ГДЕ
		|	ФискальныеОперации.ИдентификаторОплатыПлатежнойСистемы = &ФискальныйПризнак
		|	И ФискальныеОперации.ИдентификаторОплатыПлатежнойСистемы <> """"");
		
		Запрос.УстановитьПараметр("ФискальныйПризнак", Штрихкод);
		ВыборкаНайденныхЧеков = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаНайденныхЧеков.Следующий() Цикл
			НайденныеЧеки.Добавить(ВыборкаНайденныхЧеков.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НайденныеЧеки.Количество() > 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ТаблицаЧековККМ,
			"Ссылка",
			НайденныеЧеки,
			ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПодключениеОборудованиеПоИдентификаторуЗавершение(Данные, СтрокаТЧ) Экспорт

	Если НЕ Данные.Результат Тогда
		
		ОписаниеОшибки = СтрЗаменить(Данные.ОписаниеОшибки, "'", "");
		
		СтрокаПредупреждения = НСтр("ru = 'При подключении устройства произошла ошибка:
									|""%1"".';
									|en = 'An error occurred when connecting the device:
									|""%1"".'");
		ТекстПредупреждения = СтрШаблон(СтрокаПредупреждения, ОписаниеОшибки);
		
		ПоказатьПредупреждение(, ТекстПредупреждения);
		СтрокаТЧ.Подключено = 1;
		
	Иначе
		
		СтрокаТЧ.Подключено = 0;
		
		Если СтрокаТЧ.ТипОборудования =
					ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
						"Перечисление.ТипыПодключаемогоОборудования.ДисплейПокупателя") Тогда
			ПодключитьОбработчикОжидания("ВывестиИнформациюНаДисплейПокупателя", 0.1, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЧековККМНаВозвратСкупки()
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьТаблицуЧековККМНаВозвратСкупки(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЧековККМОплаченныхВРассрочку()
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьТаблицуЧековККМОплаченныхВРассрочку(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Представление даты сегодня.
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", НСтр("ru = 'ДФ=ЧЧ:мм'"));
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаЧековККМДата.Имя);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаЧековККМ.Дата");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоДня);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаЧековККМ.Дата");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоСледующегоДня);
	
КонецПроцедуры

#КонецОбласти
